configuration/src/InformationRegisters/НастройкиФилиалов/НастройкиФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиФилиалов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыНастроекФилиалов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор последнего изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <comment>Владелец настройки</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ЗначенияДополнительныхРеквизитовОбъектов/ЗначенияДополнительныхРеквизитовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДополнительныхРеквизитовОбъектов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыДополнительныхРеквизитов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладелецДополнительныхРеквизитов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыДополнительныхРеквизитов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СвойстваЗадач/СвойстваЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательскийСтатус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СтатистикаСтатусовНазначенныхЗадач/СтатистикаСтатусовНазначенныхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСтатусовНазначенныхЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Время</name>
    <comment>Время в секундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/Участники/Участники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Участники</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектНаблюдения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.ПолучательОповещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиУчастников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВидыДействий/ВидыДействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействий</name>
  <comment>Используется для определения типа действия</comment>
  <enumValues>
    <name>СменаИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВОчередь</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/ВнутреннееЗадание/ВнутреннееЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееЗадание</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Служит для передачи значения от проекта к заявке. Не зависит от выбранного направления. Не отображается на форме</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/Catalogs/Процессы/Процессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Процессы</name>
  <comment>Используется для настройки переходов между статусами, как стандартными, так и пользовательскими</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщий</name>
    <comment>Нужен на первое время, что бы если были ошибки, можно было бы вернуться к старой схеме</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Тип объекта, к которому относится процесс</comment>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияПриПереходах</name>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <comment>Уникальный идентификатор перехода</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <comment>Действие, выполняемое при смене статуса</comment>
      <type>
        <types>CatalogRef.ДействияПриСменеСтатуса</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Пользователь, добавивший переход</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>Дата последнего изменения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСменыСтатусов</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <comment>Текущий статус задачи</comment>
      <type>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийСтатус</name>
      <comment>Статус, в который доступен переход</comment>
      <type>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <comment>Роль пользователя, которой доступно использование перехода</comment>
      <type>
        <types>CatalogRef.РолиУчастников</types>
      </type>
    </attributes>
    <attributes>
      <name>БыстрыйДоступ</name>
      <comment>Определяет, будет ли статус помещен в выпадаюший список</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <comment>Уникальный идентификатор перехода, используется для привязки действий</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Пользователь, добавивший переход</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>Дата последнего изменения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/РолиУчастников/РолиУчастников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиУчастников</name>
  <comment>Список возможных ролей участников</comment>
  <predefined>
    <items>
      <name>Автор</name>
      <description>Автор</description>
    </items>
    <items>
      <name>ВладелецПродукта</name>
      <description>Владелец продукта</description>
    </items>
    <items>
      <name>ВсеРоли</name>
      <description>Все роли</description>
    </items>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Исполнитель</name>
      <description>Исполнитель</description>
    </items>
    <items>
      <name>Наблюдатель</name>
      <description>Наблюдатель</description>
    </items>
    <items>
      <name>Подписчик</name>
      <description>Подписчик</description>
    </items>
    <items>
      <name>ПредыдущийАвтор</name>
      <description>Предыдущий автор</description>
    </items>
    <items>
      <name>Ревьюер</name>
      <description>Ревьюер</description>
    </items>
    <items>
      <name>РуководительПроекта</name>
      <description>Руководитель проекта</description>
    </items>
    <items>
      <name>Тестировщик</name>
      <description>Тестировщик</description>
    </items>
    <items>
      <name>УчастникКомандыУправленияПроектом</name>
      <description>Участник команды управления проектом</description>
    </items>
  </predefined>
</mdclass:Catalog>

configuration/src/CommonModules/РаботаСПроцессамиВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ВыделитьСсылкиКомментария(ТекстКомментария) Экспорт
	
	РегулярноеВыражение = "(https?:\/\/(?:www\.)?[-a-zA-Z0-9@:%._\+~#=]{1,256}\.[a-zA-Z0-9()]{1,6}\b(?:[А-Яа-я-a-zA-Z0-9()@:%_\+.~#?&\/=]*))";
	ТекстКомментария = СтрЗаменитьПоРегулярномуВыражению(
		ТекстКомментария, РегулярноеВыражение, "<a href=$1>$1</a>", Истина, Истина);
		
КонецПроцедуры

// Возвращает ссылку на справочник СтатусыОбъектов
//
// Параметры:
//  Ссылка	 - СправочникСсылка.СтатусыОбъектов	 - ссылка на статус
// 
// Возвращаемое значение:
//  СправочникСсылка.СтатусыОбъектов - сслыка на справочник
//
Функция ПолучитьСсылкуНаСлужебныйСтатус(Знач Ссылка) Экспорт
	
	Возврат РаботаСПроцессами.ПолучитьСсылкуНаСлужебныйСтатус(Ссылка);
	
КонецФункции

// Возвращает ссылку на нового исполнителя для задачи
//
// Параметры:
//  Объект		 - ДокументОбъект.Задача, ДокументСсылка.Задача	 - ссылка на задачу, или сам объект
//  НовыйСтатус	 - СправочникСсылка.СтатусыОбъектов	 - ссылка на новый статус
//  Свойства	 - Структура	 - дополнительные данные, участвующие в определении назначенного
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - ссылка на нового исполнителя
//
Функция ПолучитьНовогоИсполнителяЗадачи(Знач Объект, Знач НовыйСтатус, Знач Свойства = Неопределено) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	
	// Заполнение данных объекта
	Если ТипОбъекта = Тип("ДокументСсылка.Задача") Тогда
		НазванияРеквизитов = "Ссылка, Статус, Назначена, Заказчик, СистемаУчета, Филиал, Автор";
		ДанныеОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, НазванияРеквизитов);
	Иначе
		ДанныеОбъекта = Объект;
		ПредыдущийИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Назначена");
		
		// Если исполнитель был изменен на форме, оставляем установленного пользователем исполнителя
		Если ДанныеОбъекта.Назначена <> ПредыдущийИсполнитель Тогда
			Возврат ДанныеОбъекта.Назначена;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Филиал", ДанныеОбъекта.Филиал);
	СтруктураДанных.Вставить("СтарыйСтатус", ДанныеОбъекта.Статус);
	СтруктураДанных.Вставить("НовыйСтатус", НовыйСтатус);
	
	ТипОбъекта = Справочники.ТипыОбъектовВладельцев.НайтиСвязанныйЭлемент(Объект.Ссылка);
	
	ВидДействия = Перечисления.ВидыДействий.СменаИсполнителя;
	Действие = Справочники.Процессы.ПолучитьДействияСменыСтатуса(ТипОбъекта, СтруктураДанных, ВидДействия);
	Если Действие <> Неопределено Тогда
		Результат = ПолучитьНовогоИсполнителяПоДействию(ДанныеОбъекта, Действие, Свойства);
	Иначе
		Результат = ПолучитьНовогоИсполнителяБезДействия(ДанныеОбъекта, НовыйСтатус, Свойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Назначить задачу на пользователя
//
// Параметры:
//  Задача			 - ДокументСсылка.Задача - задача
//  Пользователь	 - СправочникСсылка.Пользователи - исполнитель
//  ПулНаРазработку	 - Булево - это пул на разработку
// 
// Возвращаемое значение:
//  Структура - успешность выполнения
//
Функция НазначитьЗадачуНаПользователя(Знач Задача, Знач Пользователь = Неопределено, Знач ПулНаРазработку = Ложь) Экспорт
	
	Результат = Новый Структура("Успешно, Сообщение", Истина, "");
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	Если ЗначениеЗаполнено(ЗадачаОбъект.Назначена) Тогда
		Результат.Успешно = Ложь;
		Результат.Сообщение = СтрШаблон("Задача уже назначена на %1", 
			ОбщегоНазначенияКлиентСервер.ПолучитьФамилиюИнициалыПользователя(Строка(Задача.Назначена)));
		Возврат Результат;
	КонецЕсли;
	
	ЗадачаОбъект.Назначена = Пользователь;
	Если ПулНаРазработку Тогда
		ЗадачаОбъект.Статус = Справочники.СтатусыОбъектов.ВРеализацию;
	КонецЕсли;
	
	Попытка
		ЗадачаОбъект.Записать();
	Исключение
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Во время записи задачи возникла непредвиденная ситуация. =( " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Обновить статус задачи
//
// Параметры:
//  Данные		 - Стурктура - Структура данных
//  	* Задача - ДокументСсылка.Задача
//  	* Статус - СправочникСсылка.СтатусыОбъектов
//  	* ЕстьНезакрытыйПериод - Булево
//  Результат	 - Структура - Результат закрытия формы изменения статуса
//
Процедура ОбновитьСтатусЗадачи(Знач Данные, Знач Результат) Экспорт 
	
	Объект = Данные.Задача.ПолучитьОбъект(); 
	НовыйСтатус = Данные.Статус;
	Объект.Статус = НовыйСтатус;
	Объект.Назначена = Результат.НазначитьНа;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Назначена", Результат.НазначитьНа);		
	ПараметрыЗаписи.Вставить("НовыйСтатус", НовыйСтатус);
	ПараметрыЗаписи.Вставить("ВидОперации", Неопределено);
	ПараметрыЗаписи.Вставить("Комментарий", Результат.Комментарий);
	ПараметрыЗаписи.Вставить("ЕстьНезакрытыйПериодПриостановки", Данные.ЕстьНезакрытыйПериод);
	ПараметрыЗаписи.Вставить("Трудозатраты", Результат.Трудозатраты);
	ПараметрыЗаписи.Вставить("ОбновитьДатыПоследнихИзменений");
	ПараметрыЗаписи.Вставить("ПроверкаОтсутствияНазначенного");
	
	Если Результат.Свойство("ПричинаИзмененияСтатуса") Тогда
		ПараметрыЗаписи.Вставить("ПричинаИзмененияСтатуса", Результат.ПричинаИзмененияСтатуса);
		ПараметрыЗаписи.Вставить("НеобходимоОтправитьУведомление", Результат.НеобходимоОтправитьУведомление);
	КонецЕсли;
	
	Если НовыйСтатус = Справочники.СтатусыОбъектов.Приостановлен Тогда
		ПараметрыЗаписи.ВидОперации = Справочники.СтатусыОбъектов.Приостановлен;
		
	ИначеЕсли НовыйСтатус = Справочники.СтатусыОбъектов.ВРаботе 
		И ТипЗнч(Объект.ОбъектОснование) = Тип("ДокументСсылка.ЗаявкаНаРазработку") 
		И ЗначениеЗаполнено(Объект.ОбъектОснование) Тогда
		ПараметрыЗаписи.ВидОперации = Справочники.СтатусыОбъектов.ВРаботе;			
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Вставить("ПроверкаИзмененияСтатусаПередЗаписью", ПараметрыЗаписи);
	
	Объект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьДополнительныеСвойства(Знач Ссылка, Знач Филиал) Экспорт
	
	ВидыНастроекФилиалов = ПланыВидовХарактеристик.ВидыНастроекФилиалов;
		
	Настройка = РегистрыСведений.НастройкиФилиалов.ЗначениеНастройки(
		Филиал, ВидыНастроекФилиалов.ИсполнителяCodeReviewНазначаетРуководитель);

	Свойства = Новый Структура;	
	Свойства.Вставить("ИсполнителяCodeReviewНазначаетРуководитель", Настройка);
	
	Реквизит = ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.РевьюерОбъекта;
	Ревьюер = РегистрыСведений.ЗначенияДополнительныхРеквизитовОбъектов.ЗначениеДополнительногоРеквизита(Ссылка, Реквизит);
	
	Свойства.Вставить("Ревьюер", Ревьюер);
	
	Возврат Свойства;
	
КонецФункции

Функция ПолучитьНовогоИсполнителяПоДействию(Знач ДанныеОбъекта, Знач Действие, Знач Свойства)
	
	// Заказчик
	Если Действие = Справочники.ДействияПриСменеСтатуса.СменаИсполнителяНаЗаказчика Тогда
		Результат = ДанныеОбъекта.Заказчик;
		
	// Последний разработчик
	ИначеЕсли Действие = Справочники.ДействияПриСменеСтатуса.СменаИсполнителяНаПоследнегоРазработчика Тогда
		Результат = ПолучитьПоследнегоРазработчикаЗадачи(ДанныеОбъекта.Ссылка);
		
	// Последний тестировщик
	ИначеЕсли Действие = Справочники.ДействияПриСменеСтатуса.СменаИсполнителяНаПоследнегоТестировщика Тогда
		Результат = ПолучитьПоследнегоТестировщикаЗадачи(ДанныеОбъекта.Ссылка);
		
	// Последний ревьюер
	ИначеЕсли Действие = Справочники.ДействияПриСменеСтатуса.СменаИсполнителяНаПоследнегоРевьюера Тогда
		Результат = ПолучитьПоследнегоРевьюераЗадачи(ДанныеОбъекта.Ссылка);
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Если Свойства = Неопределено Тогда
				Реквизит = ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.РевьюерОбъекта;
				Ревьюер = РегистрыСведений.ЗначенияДополнительныхРеквизитовОбъектов.ЗначениеДополнительногоРеквизита(
					ДанныеОбъекта.Ссылка, Реквизит);
			Иначе
				Ревьюер = Свойства.Ревьюер;
			КонецЕсли;
			
			Результат = ПолучитьРевьюера(ДанныеОбъекта.Назначена, Ревьюер);
		КонецЕсли;

	// Автор задачи
	ИначеЕсли Действие = Справочники.ДействияПриСменеСтатуса.СменаИсполнителяНаАвтораЗадачи Тогда
		Результат = ДанныеОбъекта.Автор;	

	// Текущий исполнитель
	ИначеЕсли Действие = Справочники.ДействияПриСменеСтатуса.ОставитьТекущегоИсполнителя Тогда
		Результат = ДанныеОбъекта.Назначена;			
		
	ИначеЕсли Действие = Справочники.ДействияПриСменеСтатуса.СменаИсполнителяНаПредыдущегоИсполнителя Тогда
		Результат = ПолучитьПредыдущегоИсполнителяЗадачи(ДанныеОбъекта.Ссылка);	
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	// Незаполненное значение
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНовогоИсполнителяБезДействия(Знач ДанныеОбъекта, Знач НовыйСтатус, Знач Свойства)
	
	Если Свойства = Неопределено Тогда
		Свойства = ЗаполнитьДополнительныеСвойства(ДанныеОбъекта.Ссылка, ДанныеОбъекта.Филиал);
	КонецЕсли;
	
	// Для статусов получаем ссылки на справочник СтатусыОбъектов
	НовыйСтатус = ПолучитьСсылкуНаСлужебныйСтатус(НовыйСтатус);
	СтарыйСтатус = ПолучитьСсылкуНаСлужебныйСтатус(ДанныеОбъекта.Статус);
	
	Если НовыйСтатус = Справочники.СтатусыОбъектов.Рассмотрение 
		И СтарыйСтатус = Справочники.СтатусыОбъектов.НаДоработку Тогда
		
		Результат = РегистрыСведений.СвойстваЗадач.ОтправительНаДоработку(ДанныеОбъекта.Ссылка);
		
	ИначеЕсли НовыйСтатус = Справочники.СтатусыОбъектов.НаДоработку Тогда
		
		Результат = ДанныеОбъекта.Автор;
		
	// При переводе задачи в тестирование по системе "WEB - база" получим последнего тестировщика
	// или оставим исполнителя пустым. В последнем случае, задача попадет в пул тестирования QA.
	ИначеЕсли НовыйСтатус = Справочники.СтатусыОбъектов.Тестирование
		И ДанныеОбъекта.СистемаУчета = Справочники.СистемыУчета.НайтиПоКоду("00008") Тогда
		
		Результат = ПолучитьПоследнегоТестировщикаЗадачи(ДанныеОбъекта.Ссылка);
		
	ИначеЕсли НовыйСтатус = Справочники.СтатусыОбъектов.CodeReview Тогда
		
		Ревьюер = ПолучитьРевьюера(ДанныеОбъекта.Назначена, Свойства.Ревьюер);
				
		// Если уже известен ревьюер для задачи или сотрудника, устанавливаем его
		Если ЗначениеЗаполнено(Ревьюер) Тогда
			Результат = Ревьюер;
						
		// Если руководитель самостоятельно назначает исполнителей для ревью,
		// получим последнего назначенного на ревью пользователя, или оставим поле пустым
		ИначеЕсли Свойства.ИсполнителяCodeReviewНазначаетРуководитель Тогда
			Результат = ПолучитьПоследнегоРевьюераЗадачи(ДанныеОбъекта.Ссылка);
			
		Иначе
			// Если ничего не подошло, оставляем текущего исполнителя
			Результат = ДанныеОбъекта.Назначена;
		КонецЕсли;
		
	ИначеЕсли СтарыйСтатус = Справочники.СтатусыОбъектов.Приостановлен Тогда
		Результат = ДанныеОбъекта.Назначена;
			
	ИначеЕсли ТипЗнч(ДанныеОбъекта.Ссылка) = Тип("ДокументСсылка.ВнутреннееЗадание") Тогда  
		Результат = Документы.ВнутреннееЗадание.ПолучитьНазначеного(НовыйСтатус, ДанныеОбъекта.Ссылка, 
			ДанныеОбъекта.Направление, ДанныеОбъекта.Заказчик, ДанныеОбъекта.Назначена);
		
	Иначе
		Результат = Документы.Задача.ОбновитьИсполнителя(ДанныеОбъекта.Ссылка,
			НовыйСтатус, ДанныеОбъекта.Заказчик, ДанныеОбъекта.Назначена);   
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРевьюера(Назначенный, РевьюерЗадачи)
	
	// Если заполнен ревьюер для задачи
	Если ЗначениеЗаполнено(РевьюерЗадачи) Тогда
		Ревьюер = РевьюерЗадачи;
	Иначе
		// В противном случае, безе ревьюера для исполнителя, согласно настройкам филиала
		Ревьюер = ПолучитьРевьюераДляИсполнителя(Назначенный);
	КонецЕсли;
	
	Возврат Ревьюер;
	
КонецФункции

Функция ПолучитьРевьюераДляИсполнителя(Знач Исполнитель)
	
	Возврат РегистрыСведений.ЗначенияДополнительныхРеквизитовОбъектов.ЗначениеДополнительногоРеквизита(Исполнитель,
		ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.РевьюерОбъекта);
	
КонецФункции

Функция ПолучитьПоследнегоРазработчикаЗадачи(Знач Задача)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвойстваЗадачСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.СвойстваЗадач.СрезПоследних(
	|			,
	|			Объект = &Объект
	|				И Статус = ЗНАЧЕНИЕ(Справочник.СтатусыОбъектов.ВРаботе)) КАК СвойстваЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Объект", Задача);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Исполнитель").Получить(0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоследнегоРевьюераЗадачи(Знач Задача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Статусы
	|ИЗ
	|	Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.СтатусыОбъектов.CodeReview))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтатистикаСтатусовНазначенныхЗадач.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.СтатистикаСтатусовНазначенныхЗадач КАК СтатистикаСтатусовНазначенныхЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Статусы КАК Статусы
	|		ПО СтатистикаСтатусовНазначенныхЗадач.Статус = Статусы.Ссылка
	|ГДЕ
	|	СтатистикаСтатусовНазначенныхЗадач.Задача = &Задача
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатистикаСтатусовНазначенныхЗадач.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоследнегоТестировщикаЗадачи(Знач Задача)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвойстваЗадачСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.СвойстваЗадач.СрезПоследних(
	|			,
	|			Объект = &Объект
	|				И Статус = ЗНАЧЕНИЕ(Справочник.СтатусыОбъектов.Тестирование)) КАК СвойстваЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Объект", Задача);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Исполнитель").Получить(0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредыдущегоИсполнителяЗадачи(Знач Задача) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваЗадач.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.СвойстваЗадач КАК СвойстваЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Участники КАК Участники
	|		ПО (Участники.Пользователь = СвойстваЗадач.Исполнитель)
	|			И СвойстваЗадач.Объект = Участники.Объект
	|ГДЕ
	|	Участники.Роль = ЗНАЧЕНИЕ(Справочник.РолиУчастников.Исполнитель)
	|	И СвойстваЗадач.Объект = &Объект
	|	И Участники.Скрытый
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвойстваЗадач.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", Задача);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Исполнитель").Получить(0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
